Repository: smellodi/autold-2ch
Catalog: olfactory-test/Properties/Resources.*.resx
Languages: fi

source: Setup
fi: Asetukset

source: automatic
fi: Automaattinen

# BackToHome
source: Back to home page
fi: Takaisin aloitussivulle

source: Clean air
fi: Puhdas ilma

source: Clear
fi: Tyhjennä

source: Close
fi: Sulje

source: Continue
fi: Jatka

source: Direction
fi: Suunta

# DurationsSec
source: Durations in seconds
fi: Kesto sekunteina

# CannotOpenPort
source: Cannot open the port
fi: Porttia ei voida avata

source: Exit
fi: Sulje

# FamilInstrContinue
source: Click 'Start the test' to continue.
fi: Paina 'Aloita testi' jatkaaksesi.

# FamilInstrOpenValve
source: After opening the valve, please wait for few seconds before the odour reaches you, then spend some time memorizing it.
fi: Avattuasi venttiilin, odota muutama sekunti, jotta tuoksua erittyy maskiin. Kun tuoksua erittyy maskiin, haista sitä, ja paina tuoksu mieleesi.

# FamilInstrPreparing
source: Preparing the odour
fi: Valmistellaan tuoksua

# FamilInstrSniff
source: Odour is flowing now, sniff it!
fi: Nyt voit haistaa tuoksua.

source: Feedback loop
fi: Takaisinkytkentä

source: Finished
fi: Valmis

source: Graph
fi: Kuvaaja

# InfoF2
source: Press F2 to simulate COM ports.
fi: Paina F2 simuloidaksesi sarjaportteja.

# InfoF5
source: Press F5 any time to show the logging window.
fi: Paina F5 näyttääksesi monitorointi-ikkunan.

source: Input
fi: Syöte

source: Instructions
fi: Ohjeet

source: manual
fi: Manuaalinen

# OdorPulses
source: Odour Pulses
fi: Tuoksupulssit

# OdorSensitivity
source: Your odour sensitivity (ml/min):
fi: Sinun tuoksuherkkyytesi on (ml/min):

# OdorStartsAfterInhale
source: Odour flow starts when inhale start is detected
fi: Tuoksuvirtaus alkaa, kun sisäänhengitys alkaa

# OdorStartsAfterKeyPress
source: Odour flow starts when a user pressed SPACE key
fi: Tuoksuvirtaus alkaa, kun painat välilyöntiä

# OdorStartsImmediately
source: Odour flow starts immediately after the odour is ready
fi: Tuoksuvirtaus alkaa välittömästi, kun tuoksu on valmis

source: Open
fi: Avaa

# OpenValve
source: Open the odour valve
fi: Avaa tuoksuventtiili

source: Pen
fi: Kynä

# PIDTemp
source: Temperature detector current
fi: Lämpötila-anturin virta

source: PID voltage
fi: PID jännite

source: Pulses
fi: Pulssit

source: Result
fi: Tulos

source: Save
fi: Tallenna

source: Save data
fi: Tallenna tiedot

source: Scented air
fi: Tuoksuva ilma

source: seconds
fi: sekuntia

source: Serial ports
fi: Sarjaportit

source: Set
fi: Aseta

source: Settings
fi: Asetukset

source: Start
fi: Aloita

# StartTest
source: Start the test
fi: Aloita testi

source: Step
fi: Vaihe

source: system
fi: järjestelmä

source: Table
fi: Taulukko

# Temp
source: Temp (C)
fi: Lämp (C)

source: Text
fi: Teksti

source: Thank you!
fi: Kiitos!

source: Threshold Test
fi: Kynnysarvomittaus

# CommaSeparatedListWithExpressions
source: A list of comma-separated values or expressions. Expressions are of the form 'VALUE x COUNT'. Example: '4, 8, 16x2, 32x3'
fi: Lista pilkulla erotettuja arvoja tai lausekkeita. Lausekkeet ovat muodossa 'ARVOxLUKUMÄÄRÄ'. Esimerkiksi: '4, 8, 16x2, 32x3'

# CorrectAndTryAgain
source: Please correct and try again.
fi: Korjaa virheellinen syöte ja yritä uudestaan.

source: Events
fi: Tapahtumat

source: Familiarization
fi: Totuttautuminen

# FamiliarizeOdor
source: Familiarize with the odour
fi: Totuttaudu tuoksuun

# FamilInstrVentilating
source: Please wait while the tube is ventilating...
fi: Ole hyvä ja odota hetki, että tuoksu poistuu maskista...

source: Final pause
fi: Toinen tauko

# NumNotNeg
source: a non-negative number
fi: ei-negatiivinen luku

# NumPos
source: a positive number
fi: positiviinen luku

# NumPosSpaceSep
source: space-separated positive numbers
fi: välilyönnillä erotetut positiiviset luvut

source: immediate
fi: Välitön

source: Initial pause
fi: Ensim. tauko

source: Interrupt
fi: Keskeytä

# IntNotNeg
source: a non-negative integer value
fi: ei-negatiivinen kokonaisluku

# IntPos
source: a positive integer number
fi: positiivinen kokonaisluku

source: Language
fi: Kieli

source: Light
fi: Valo

source: MFC Playground
fi: MFC Kokeilukenttä

# OdorantHere
source: Odourant was here
fi: Tuoksu oli tässä

# OdorFlow
source: Odour flow
fi: Tuoksuvirtaus

# OdorLevel
source: Odour level
fi: Tuoksutaso

# OdorLevels
source: Odour levels
fi: Tuoksutasot

# OdorPreparation
source: Odour preparation
fi: Tuoksun valmistaminen

source: Pen presentation
fi: Kynän esittäminen

# PenSniffing
source: Sniffing
fi: Kynän haistaminen

source: PID sampling
fi: PID näytteenottoväli

source: Procedure
fi: Toimenpide

# RecognInRow
source: Recognitions in row
fi: Tunnistusta peräkkäin

# ThTestInstrSelectPen
source: Please select the scented pen.
fi: Valitse kynä, jossa oli tuoksua.

# ThTestInstrSniff
source: Sniff the pen
fi: Haista kynää

# ThTestInstrWait
source: Please wait until the odorant is ready.
fi: Ole hyvä ja odota kunnes tuoksuaine on valmis.

source: Time
fi: Aika

source: To collect
fi: Käännöspisteet

source: To count
fi: Huomioitavat

# ToKeepTargetLevel
source: to keep the target level
fi: pitää tavoitetason

# ToReachTargetLevel
source: to reach the target level
fi: saavuttaa tavoitetason

source: Turnings
fi: Käännöspisteet

source: unknown
fi: tuntematon

source: user
fi: käyttäjä

source: Valves
fi: Venttiilit

# NoDataToSave
source: There is no data to save
fi: Tallennettavaa tietoa ei ole

source: waste
fi: poisto

# AppTerminated
source: The application is terminated.
fi: Ohjelma on suljettu.

# ControlsValve2
source: Controls the Valve #2 during odour flow. This valve is directed to waste during both pauses.
fi: Ohjaa venttiiliä #2 tuoksuvirtauksen aikana. Tämä tuoksuvirta ohjataan poistoon molempien taukojen aikana.

source: Data saved into
fi: Tiedot on tallennettu kohteeseen

# DeviceConnLost
source: Connection with the {0} device was shut down.
fi: Yhteys laitteeseen {0} katkesi.

# EmptyList
source: The list of values is empty
fi: Listassa ei ole arvoja

# ExpressionNotValid
source: The expression '{0}' is invalid, only '{1}' operations are allowed
fi: Lauseke '{0}' ei kelpaa. Ainoastaan '{1}' operaatiot ovat sallittuja.

# FailedToSave
source: Failed to save data into
fi: Tietoja ei voitu tallentaa kohteeseen

# OdorFlowTooHigh
source: The odor flow rate is too high to be ready in {0} seconds.
fi: Tuoksun virtausnopeus on liian suuri ollakseen valmis {0} sekunnissa.

# PressCancelToDiscard
source: Press 'Cancel' to discard the data.
fi: Paina 'Peruuta', jos et halua tallentaa tietoja.

# PressNoToChangeNameFolder
source: Press 'No' to change the name and/or folder.
fi: Paina 'Ei', jos haluat vaihtaa tiedostonimen tai kohdekansion.

source: Retry?
fi: Aloita uudestaan?

# SaveDataInto
source: Would you like to save data into
fi: Haluatko tallentaa tiedot kohteeseen

source: Olfactory test tool
fi: Hajuaistin testaustyökalu

# ThTestInstrDone
source: Thanks, your choice has been recorded.
fi: Kiitos, valintasi on tallennettu.

# ThTestInstrInhale
source: Make an inhale
fi: Hengitä sisään

# ThTestInstrPressKey
source: Press SPACE when start inhaling
fi: Paina VÄLILYÖNTIÄ, kun aloitat sisäänhengityksen

source: COM Monitor
fi: Sarjaporttien monitorointi

source: Show as
fi: Näytä

# ValueFormatNotValid
source: The type of value '{0}' is invalid, it must be a '{1}' number
fi: Arvon '{0}' tietotyyyppi on väärä, sen täytyy olla '{1}' luku

# ValueTooLarge
source: The value '{0}' is too large, is must be no greater than '{1}'
fi: Arvo '{0}' on liian suuri, se ei saa olla suurempi kuin '{1}'

# ValueTooSmall
source: The value '{0}' is too small, is must be no smaller than '{1}'
fi: Arvo '{0}' on liian pieni, sen ei saa olla pienempi kuin '{1}'

# CommaSeparatedValues
source: comma-separated positive floating-point values or expressions in a form 'VALUExCOUNT'
fi: pilkulla erotetut positiiviset liukuluvut tai lausekkeet. Lausekkeet muodossa 'ARVOxLUKUMÄÄRÄ'

source: Pulse flow rate
fi: Pulssivirtauksen nopeus

source: Logger
fi: Tietojen kerääjä

source: Validator
fi: Validoija

# ThTestInstrIntro
source: Your sense of smell is to be tested. The test will take approximately 30-40 minutes.
fi: Seuraavaksi mitataan hajuaistisi toimintaa. Mittaus kestää noin 30-40 minuuttia.

# ThTestInstrFinal
source: All substances contained in the test are non-toxic and not harmful in the used concentrations.
fi: Kaikki käytetyt tuoksut ovat turvallisia hengittää.

# ThTestInstrRN
source: [RESEARCHER NOTE] More instruction can be added here. We could even collect personal data on this page to store it later in log files along the data.
fi: [HUOMIO TUTKIJOILLE] Voit kirjoittaa tähän lisäohjeita. Tällä sivulla voi kerätä esimerkiksi henkilötietoja, jotka tallennetaan myöhemmin lokitiedostoon muun tiedon kanssa.

# ThTestInstrThreePens
source: Repeatedly, three pens will be presented to you one after another. Only one of these pens contains the odorant. You have to find out the pen in which you think you have perceived the odorant. If you should not be able to smell and thus cannot decide on an answer, please just guess.
fi: Sinulle esitetään vuoronperään kolme kynää. Vain yhdessä kynässä on tuoksua. Sinun tehtäväsi on kertoa missä kynässä oli tuoksua. Jos et osaa sanoa missä kynässä oli tuoksua, niin arvaa.

source: Temperature
fi: Lämpötila

source: Cancel
fi: Peruuta

# ThTestInstrTwoPens
source: Repeatedly, two pens will be presented to you one after another. Only one of these pens contains the odorant. You have to find out the pen in which you think you have perceived the odorant. If you should not be able to smell and thus cannot decide on an answer, please just guess.
fi: Sinulle esitetään vuoronperään kaksi kynää. Vain yhdessä kynässä on tuoksua. Sinun tehtäväsi on kertoa missä kynässä oli tuoksua. Jos et osaa sanoa missä kynässä oli tuoksua, niin arvaa.

source: No
fi: Ei

source: Yes
fi: Kyllä

source: one pen
fi: yksi kynä

source: three pens
fi: kolme kynää

source: two pens
fi: kaksi kynää

source: Procedure type
fi: Menettelytapa

source: Flow start
fi: Virtauksen aloittaminen

# ProcTypeOnePen
source: Users have to answer whether the presented pen smells or not
fi: Käyttäjän tulee vastata, oliko kynässä tuoksua vai ei

# ProcTypeThreePens
source: Three pens are presented to users, they are forced to select the one that smells
fi: Käyttäjälle esitetään kolme kynää. Hänen tulee valita kynä, jossa oli tuoksua.

# ProcTypeTwoPens
source: Two pens are presented to users, they are forced to select the one that smells
fi: Käyttäjälle esitetään kaksi kynää. Hänen tulee valita kynä, jossa oli tuoksua.

# ThTestInstrOnePen
source: Repeatedly, you will be asked to sniff an air flow directed to the mask. You have to find out whether you have perceived the odorant.
fi: Kohta sinua pyydetään toistuvasti haistamaan maskiin tulevaa ilmaa ja vastaamaan haistoitko tuoksua.

# ThTestInstrChooseOdor
source: Did you smell the odour?
fi: Haistoitko tuoksun?

source: Decreasing
fi: Laskeva

source: Increasing
fi: Nouseva
